<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpId;
                helpId = window.location.hash.substring(1);
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                }
            }
        }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription", class="largesize">
        <h2>Resumir Dentro</h2><p/>
        <h2></h2>
        <hr/>
    <p>Esta ferramenta localiza elementos (e partes de elementos) que se encontram dentro dos limites de &aacute;reas na camada de an&aacute;lise.  Por exemplo:
        <ul>
            <li>Tendo em conta uma camada de limites de separa&ccedil;&atilde;o de &aacute;gua e uma camada de limites de utiliza&ccedil;&atilde;o de terreno por tipo de utiliza&ccedil;&atilde;o, calcular a &aacute;rea total de tipo de utiliza&ccedil;&atilde;o de terreno por cada separa&ccedil;&atilde;o de &aacute;gua. 
            </li>
            <li>Tendo em conta uma camada de parcelas num concelho e uma camada de limites urbanos, resumir o valor m&eacute;dio de parcelas vazias dentro de cada limite urbano.
            </li>
        </ul>
        
    </p>
    <p>Se marcar a op&ccedil;&atilde;o 
        <b>Utilizar a extens&atilde;o atual do mapa</b>, ser&atilde;o resumidos apenas os elementos da camada de an&aacute;lise e da camada que pretende resumir que est&atilde;o vis&iacute;veis na extens&atilde;o atual do mapa.  Se n&atilde;o marcar a op&ccedil;&atilde;o, ser&atilde;o analisados todos os elementos da camada de an&aacute;lise e da camada que pretende resumir, mesmo que estejam fora da extens&atilde;o atual do mapa.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="Summarize">
        <div><h2>Choose layer to summarize</h2></div>
        <hr/>
        <div>
            <p>Ser&atilde;o resumidos os elementos desta camada que estejam dentro dos limites de elementos inclu&iacute;dos na camada de entrada. 
            </p>
        </div>
    </div>
    <div id="StatisticsPoint">
        <div><h2>Add statistics from</h2></div>
        <hr/>
        <div>
            <p>Opcionalmente, pode calcular estat&iacute;sticas relativas aos atributos num&eacute;ricos dos pontos que se encontram dentro dos limites de elementos. 
            </p>
            <p>Se marcar a caixa de sele&ccedil;&atilde;o 
                <b>Contagem de pontos</b>, pode calcular o n&uacute;mero total de pontos dentro de cada limite de &aacute;rea.  Adicionalmente, pode calcular estat&iacute;sticas relativas aos atributos num&eacute;ricos dos pontos que se encontram dentro de cada limite de &aacute;rea.
            </p>
            <ul>
                <li>
                    <b>Soma</b> &ndash; Valor total do campo definido.
                </li>
                <li>
                    <b>M&eacute;dia</b> &ndash; Valor m&eacute;dio do campo definido.
                </li>
                <li>
                    <b>M&iacute;nimo</b> &ndash; O valor mais pequeno no campo definido.
                </li>
                <li>
                    <b>M&aacute;ximo</b> &ndash; O valor maior no campo definido.
                </li>
                <li>
                    <b>Desvio Padr&atilde;o</b> &ndash; Desvio padr&atilde;o dos valores no campo definido.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="StatisticsLine">
        <div><h2>Add statistics from</h2></div>
        <hr/>
        <div>
            <p>Opcionalmente, pode calcular estat&iacute;sticas relativas aos atributos num&eacute;ricos das linhas pr&oacute;ximas. 
            </p>
            <p>Se marcar a caixa de sele&ccedil;&atilde;o 
                <b>Comprimento total das linhas em</b>, pode calcular o comprimento total das linhas dentro de cada limite de &aacute;rea.  Adicionalmente, pode calcular estat&iacute;sticas relativas aos atributos num&eacute;ricos das linhas que se encontram dentro de cada limite de &aacute;rea.
            </p>
            <ul>
                <li>
                    <b>Soma</b> &ndash; Valor total do campo definido.
                </li>
                <li>
                    <b>M&eacute;dia</b> &ndash; Valor m&eacute;dio do campo definido.
                </li>
                <li>
                    <b>M&iacute;nimo</b> &ndash; O valor mais pequeno no campo definido.
                </li>
                <li>
                    <b>M&aacute;ximo</b> &ndash; O valor maior no campo definido.
                </li>
                <li>
                    <b>Desvio Padr&atilde;o</b> &ndash; Desvio padr&atilde;o dos valores no campo definido.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="StatisticsPolygon">
        <div><h2>Add statistics from</h2></div>
        <hr/>
        <div>
            <p>Opcionalmente, pode calcular estat&iacute;sticas relativas aos atributos num&eacute;ricos das &aacute;reas pr&oacute;ximas. 
            </p>
            <p>Se marcar a caixa de sele&ccedil;&atilde;o 
                <b>Soma da &aacute;rea utilizando</b>, pode calcular a &aacute;rea total dos elementos que se encontram dentro de cada limite de &aacute;rea da camada de an&aacute;lise.  Adicionalmente, pode calcular estat&iacute;sticas relativas aos atributos num&eacute;ricos dos elementos que se encontram dentro de cada limite de &aacute;rea.
            </p>
            <ul>
                <li>
                    <b>Soma</b> &ndash; Valor total do campo definido.
                </li>
                <li>
                    <b>M&eacute;dia</b> &ndash; Valor m&eacute;dio do campo definido.
                </li>
                <li>
                    <b>M&iacute;nimo</b> &ndash; O valor mais pequeno no campo definido.
                </li>
                <li>
                    <b>M&aacute;ximo</b> &ndash; O valor maior no campo definido.
                </li>
                <li>
                    <b>Desvio Padr&atilde;o</b> &ndash; Desvio padr&atilde;o dos valores no campo definido.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="GroupBy">
        <div><h2>Choose attribute to group by</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; um atributo dos elementos 
                <b>Resumir</b> que pode utilizar para calcular estat&iacute;sticas separadamente para cada valor de atributo &uacute;nico. Por exemplo, suponha que a camada de an&aacute;lise cont&eacute;m limites urbanos e os elementos
                <b>Resumir</b> s&atilde;o parcelas.  Um dos atributos das parcelas &eacute;
                <i>Status</i>, que cont&eacute;m dois valores: VAZIA e OCUPADA. Para calcular a &aacute;rea total (ou qualquer outro atributo, como
                <i>Value</i>) de parcelas vazias ou ocupadas dentro dos limites de cidades, utilize
                <i>Status</i> como atributo de agrupamento.
            </p>
        </div>
    </div>
    <div id="ResultLayerName">
        <div><h2>Result layer name</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; o nome da camada que ser&aacute; criada em 
                <b>O Meu Conte&uacute;do</b> e adicionada ao mapa.  O nome padr&atilde;o &eacute; baseado no nome da camada de an&aacute;lise. Se a camada j&aacute; existir, ser-lhe-&aacute; pedido que confirme se pretende substituir a camada.
            </p>
            <p>Utilizando a caixa de lista pendente 
                <b>Guardar resultado em</b>, pode definir o nome de uma pasta em
                <b>O Meu Conte&uacute;do</b> para guardar o resultado.
            </p>
        </div>
    </div>
</div>
</html>
